wmqScalaTest/out2.xml

<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:int="urn:EEC:Interaction:v1.0"><soap:Header>
    <wsa:To>EAEU://BY/CP/P.MM.01/P.MM.01.ACT.001</wsa:To>
    <wsa:ReplyTo>
      <wsa:Address>EAEU://EEC/SR/NSI</wsa:Address>
    </wsa:ReplyTo>
    <wsa:MessageID>urn:uuid:f7f68fa2-a722-4eac-b1f8-40207879bd14</wsa:MessageID>
    <wsa:RelatesTo>urn:uuid:553c335b-ae68-4c56-8ff3-320fb95561fc</wsa:RelatesTo>
    <wsa:Action>int://CP/P.MM.01/0.1/P.MM.01.PRC.004/P.MM.01.TRN.004/null/P.MM.01.MSG.005</wsa:Action>
    <int:ConversationID>urn:uuid:bc89fcdf-73c2-4bd9-9c94-afff8eebf1e2</int:ConversationID>
    <int:ProcedureID>urn:uuid:7e4870f0-1eeb-4e4a-832d-0bedf071534f</int:ProcedureID>
  <int:Integration>
                        <int:TrackID>urn:uuid:b5774046-a829-41fb-8e1a-296aeaa1eec0</int:TrackID>
                        <int:AcceptTime>2015-08-04T15:54:15+05:00</int:AcceptTime>
                    </int:Integration></soap:Header><soap:Body>
    <doc:ResourceStatusDetails xmlns:doc="urn:EEC:R:ResourceStatusDetails:v0.4.2" xmlns:ccdo="urn:EEC:M:ComplexDataObjects:v0.4.2" xmlns:csdo="urn:EEC:M:SimpleDataObjects:v0.4.2">
      <ccdo:EDocHeader>
        <csdo:InfEnvelopeCode>P.MM.01.MSG.005</csdo:InfEnvelopeCode>
        <csdo:EDocCode>R.007</csdo:EDocCode>
        <csdo:EDocId>8121e805-f8b2-425b-abb1-5cb5ab38ef3e</csdo:EDocId>
        <csdo:EDocRefId>2e57d7d1-d819-495f-bdc7-9c1b527abbbc</csdo:EDocRefId>
        <csdo:EDocDateTime>2015-07-31T15:54:44</csdo:EDocDateTime>
        <csdo:LanguageCode>ru</csdo:LanguageCode>
      </ccdo:EDocHeader>
      <csdo:UpdateDateTime>2015-07-23T12:01:22Z</csdo:UpdateDateTime>
      <csdo:CountryCode></csdo:CountryCode>
    </doc:ResourceStatusDetails>
  </soap:Body></soap:Envelope>